liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
/*
 * Copyright (c) 2026 Inhero GmbH
 *
 * SPDX-License-Identifier: MIT
 *
 * Inhero MR-2 Board Module - Implementation
 * Full MeshCore feature parity via Meshtastic text message DMs.
 *
 * This module implements the complete Inhero MR-2 board support:
 *
 * === Hardware Drivers ===
 *  - INA228 power monitor (24-bit, Coulomb counting)
 *  - BQ25798 solar charger (MPPT, JEITA, multi-chemistry)
 *  - RV-3028 RTC detection (for timestamps + wake-from-sleep)
 *
 * === Power Management ===
 *  - Battery chemistry: LTO 2S / LiFePO4 1S / Li-Ion 1S
 *  - SOC: INA228 hardware Coulomb counting, auto-sync on charge-done
 *  - UVLO: Hardware alert via INA228, danger-zone shutdown
 *  - skipFsWrites: Prevents flash corruption on low-voltage boot
 *
 * === System Reliability ===
 *  - nRF52 hardware watchdog (600s timeout)
 *  - GPREGRET2 shutdown reason tracking (survives SYSTEMOFF)
 *  - Controlled shutdown: SX1262 off → RTC wake → SYSTEMOFF
 *  - Error LED blink for missing I2C components
 *
 * === Solar MPPT Management ===
 *  - Stuck PGOOD fix (HIZ toggle with 5-min cooldown)
 *  - MPPT re-enable after BQ fault events (60s cooldown)
 *
 * === Energy Analytics (168h) ===
 *  - Hourly rolling buffer for charge/discharge/solar (7 days)
 *  - Rolling averages: 24h / 3-day / 7-day
 *  - TTL (Time To Live) estimation
 *  - MPPT statistics (enabled minutes, harvested energy)
 *
 * === CLI over Text-DM ===
 *  - /get board.<key>: bat telem conf diag hwver frost imax mppt
 *                       leds uvlo ibcal tccal batcap energy
 *                       stats cinfo togglehiz
 *  - /set board.<key> <value>: (admin required)
 *  - /help /ver /reboot
 *  - Auth: config.security.admin_key[] (PKI pubkeys)
 *
 * === Telemetry ===
 *  - PowerMetrics Protobuf: ch1=Battery, ch2=Solar, ch3=System
 *  - HasBatteryLevel integration via InheroMr2BatteryLevel (Power.cpp)
 *
 * Commands are received as normal text messages (DMs) starting with '/'.
 * Write operations require the sender's public key to be registered in
 * config.security.admin_key[0..2] (same mechanism as Meshtastic AdminModule).
 */

#include "InheroMr2Module.h"
#include "MeshService.h"
#include "NodeDB.h"
#include "RTC.h"
#include "Router.h"
#include "main.h"
#include "mesh/generated/meshtastic/telemetry.pb.h"
#include <pb_encode.h>
#include <cctype>

#ifdef ARCH_NRF52
#include <nrf_wdt.h>
#include <nrf_soc.h>
#endif

InheroMr2Module *InheroMr2Module::instance = nullptr;

// Chemistry voltage parameters (from MeshCore BoardConfigContainer)
static const ChemistryParams chemistryTable[] = {
    // LTO_2S:     charge=5400, danger=4200, nominal=4600, full=5200, empty=4400
    {5400, 4200, 4600, 5200, 4400},
    // LiFePO4_1S: charge=3500, danger=2900, nominal=3200, full=3400, empty=2950
    {3500, 2900, 3200, 3400, 2950},
    // Li_Ion_1S:  charge=4100, danger=3400, nominal=3700, full=4050, empty=3500
    {4100, 3400, 3700, 4050, 3500},
    // BAT_UNKNOWN: safe defaults (= LiFePO4 thresholds)
    {3500, 2900, 3200, 3400, 2950},
};

// Default battery capacities per chemistry (mAh)
static const uint32_t defaultBatteryCapacity[] = {
    3000, // LTO_2S
    3000, // LiFePO4_1S
    3000, // Li_Ion_1S
    3000, // BAT_UNKNOWN
};

InheroMr2Module::InheroMr2Module()
    : concurrency::OSThread("InheroMr2"),
      SinglePortModule("InheroMr2", meshtastic_PortNum_TEXT_MESSAGE_APP),
      ina228(INA228_I2C_ADDR_DEFAULT)
{
    instance = this;
    // Receive DMs addressed to this node + broadcast (like ReplyBotModule)
    isPromiscuous = true;
    // Allow receiving from localhost (so config commands from serial/BLE work)
    loopbackOk = true;
}

const ChemistryParams &InheroMr2Module::getChemistryParams(BatteryChemistry chem)
{
    uint8_t idx = (uint8_t)chem;
    if (idx >= sizeof(chemistryTable) / sizeof(chemistryTable[0])) {
        idx = (uint8_t)BatteryChemistry::BAT_UNKNOWN;
    }
    return chemistryTable[idx];
}

bool InheroMr2Module::setupDrivers()
{
    LOG_INFO("InheroMr2: Initializing drivers...");

    // Check GPREGRET2 for low-voltage boot — skip flash writes to prevent corruption
#ifdef ARCH_NRF52
    uint8_t shutdownReason = NRF_POWER->GPREGRET2;
    if ((shutdownReason & 0x03) == SHUTDOWN_REASON_LOW_VOLTAGE) {
        skipFsWrites = true;
        LOG_WARN("InheroMr2: Low-voltage boot detected (GPREGRET2=0x%02X) — skipping FS writes", shutdownReason);
    }
#endif

    // Load persistent configuration (respects skipFsWrites for first-boot defaults)
    loadConfig();

    // Initialize INA228 power monitor (address 0x40 on Wire)
    ina228Ok = ina228.begin(20.0f); // 20mΩ shunt resistor
    if (ina228Ok) {
        LOG_INFO("InheroMr2: INA228 OK");
        // Apply stored calibration factor
        if (boardConfig.inaCalibration != 1.0f) {
            ina228.setCalibrationFactor(boardConfig.inaCalibration);
        }
    } else {
        LOG_WARN("InheroMr2: INA228 FAILED");
    }

    // Initialize BQ25798 solar charger (address 0x6B on Wire)
    bq25798Ok = bq25798.begin(BQ25798_DEFAULT_ADDR, &Wire);
    if (bq25798Ok) {
        LOG_INFO("InheroMr2: BQ25798 OK");
        // Apply battery chemistry config to charger
        applyChemistryConfig();
        // Configure interrupts for solar events only
        bq25798.configureSolarOnlyInterrupts();
        // Configure STAT LED based on user preference
        bq25798.setStatPinEnable(boardConfig.ledsEnabled);
    } else {
        LOG_WARN("InheroMr2: BQ25798 FAILED");
    }

    // Detect RV-3028 RTC for hourly stats timestamps
    Wire.beginTransmission(0x52);
    rtcOk = (Wire.endTransmission() == 0);
    if (rtcOk) {
        LOG_INFO("InheroMr2: RV-3028 RTC OK @ 0x52");
    } else {
        LOG_WARN("InheroMr2: RV-3028 RTC not found");
    }

    // Initialize SOC stats capacity from config
    socStats.capacity_mah = (float)getEffectiveCapacity();

    // Initialize hourly stats timestamp
    uint32_t now_time = getTime();
    if (now_time > 1000000000) {
        socStats.lastHourUpdateTime = (now_time / 3600) * 3600;
    } else {
        socStats.lastHourUpdateTime = 0; // Will init on first RTC availability
    }

    // Error LED: if any critical component missing, enable error blink
    if (!ina228Ok || !bq25798Ok || !rtcOk) {
        errorLedActive = true;
        LOG_WARN("InheroMr2: Missing components — error LED active");
        if (!ina228Ok) LOG_WARN("  - INA228 missing");
        if (!bq25798Ok) LOG_WARN("  - BQ25798 missing");
        if (!rtcOk) LOG_WARN("  - RV-3028 RTC missing");
    }

    // Start hardware watchdog (600s timeout, nRF52 only)
    setupWatchdog();

