liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
    driversInitialized = true;
    return ina228Ok || bq25798Ok;
}

int32_t InheroMr2Module::runOnce()
{
    if (!driversInitialized) {
        // First run - initialize drivers
        // Give I2C bus time to settle after boot
        setupDrivers();
        return 5000; // Next check in 5s
    }

    uint32_t now = millis();

    // Feed hardware watchdog every cycle
    feedWatchdog();

    // Read INA228 battery data
    if (ina228Ok) {
        ina228.readAll(&batteryData);

        // Voltage danger check
        const ChemistryParams &params = getChemistryParams(boardConfig.chemistry);
        if (batteryData.voltage_mv > 0 && batteryData.voltage_mv < params.dangerVoltage_mV) {
            LOG_WARN("InheroMr2: Battery DANGER! %umV < %umV danger threshold", batteryData.voltage_mv,
                     params.dangerVoltage_mV);
            // Initiate controlled shutdown with SX1262 power-off and RTC wake
            initiateShutdown(SHUTDOWN_REASON_LOW_VOLTAGE);
            // If initiateShutdown returns (shouldn't), fall through
        }
    }

    // Read BQ25798 solar data periodically (has 250ms ADC delay, don't read every cycle)
    if (bq25798Ok && (now - lastSensorRead > 30000 || lastSensorRead == 0)) {
        solarData = bq25798.getTelemetryData();
        lastSensorRead = now;

        // === Solar Power Management (ported from MeshCore) ===
        // Check for stuck PGOOD and MPPT re-enable on each solar data read
        checkAndFixPgoodStuck();
        checkAndFixSolarLogic();
    }

    // Update Coulomb counting SOC (every 10s cycle)
    updateBatterySOC();

    // Update MPPT statistics
    if (bq25798Ok && boardConfig.mpptEnabled) {
        updateMpptStats();
    }

    // Send telemetry periodically
    if (now - lastTelemetrySend > telemetryIntervalMs || lastTelemetrySend == 0) {
        sendPowerTelemetry();
        lastTelemetrySend = now;
    }

    // Minute counter for hourly stats (10s * 6 = 60s)
    minuteCounter++;
    if (minuteCounter >= 6) { // Every ~60 seconds
        minuteCounter = 0;
        // Update hourly statistics (will save when hour boundary crossed)
        updateHourlyStats();
    }

    // Update LED indicators
    updateLEDs();

    return 10000; // Run every 10 seconds
}

void InheroMr2Module::sendPowerTelemetry()
{
    meshtastic_Telemetry m = meshtastic_Telemetry_init_zero;
    m.time = getTime();
    m.which_variant = meshtastic_Telemetry_power_metrics_tag;
    m.variant.power_metrics = meshtastic_PowerMetrics_init_zero;

    // Channel 1: Battery (from INA228)
    if (ina228Ok) {
        m.variant.power_metrics.has_ch1_voltage = true;
        m.variant.power_metrics.has_ch1_current = true;
        m.variant.power_metrics.ch1_voltage = batteryData.voltage_mv / 1000.0f;
        m.variant.power_metrics.ch1_current = batteryData.current_ma;
    }

    // Channel 2: Solar (from BQ25798)
    if (bq25798Ok && solarData) {
        m.variant.power_metrics.has_ch2_voltage = true;
        m.variant.power_metrics.has_ch2_current = true;
        m.variant.power_metrics.ch2_voltage = solarData->solar.voltage / 1000.0f;
        m.variant.power_metrics.ch2_current = solarData->solar.current;
    }

    // Channel 3: System voltage
    if (bq25798Ok && solarData) {
        m.variant.power_metrics.has_ch3_voltage = true;
        m.variant.power_metrics.ch3_voltage = solarData->system.voltage / 1000.0f;
    }

    // Allocate and send packet on TELEMETRY_APP port
    meshtastic_MeshPacket *p = router->allocForSending();
    p->decoded.portnum = meshtastic_PortNum_TELEMETRY_APP;
    p->decoded.payload.size =
        pb_encode_to_bytes(p->decoded.payload.bytes, sizeof(p->decoded.payload.bytes), &meshtastic_Telemetry_msg, &m);
    p->to = NODENUM_BROADCAST;
    p->decoded.want_response = false;
    p->priority = meshtastic_MeshPacket_Priority_BACKGROUND;

    LOG_INFO("InheroMr2: Send power telem ch1=%.2fV/%.0fmA ch2=%.2fV/%.0fmA", m.variant.power_metrics.ch1_voltage,
             m.variant.power_metrics.ch1_current, m.variant.power_metrics.ch2_voltage, m.variant.power_metrics.ch2_current);

    service->sendToMesh(p, RX_SRC_LOCAL, true);
}

// === CLI Command Handling via Text Message DMs ===

bool InheroMr2Module::wantPacket(const meshtastic_MeshPacket *p)
{
    // Accept TEXT_MESSAGE_APP packets (same port as TextMessageModule/ReplyBotModule)
    return (p && p->decoded.portnum == meshtastic_PortNum_TEXT_MESSAGE_APP);
}

ProcessMessage InheroMr2Module::handleReceived(const meshtastic_MeshPacket &mp)
{
    // Only process DMs addressed to this node (not broadcasts)
    if (mp.to != nodeDB->getNodeNum() && mp.from != 0) {
        return ProcessMessage::CONTINUE;
    }

    // Extract text payload
    if (mp.decoded.payload.size == 0 || mp.decoded.payload.size > 250) {
        return ProcessMessage::CONTINUE;
    }

    // Null-terminate the payload
    char buf[260];
    size_t n = mp.decoded.payload.size;
    if (n > sizeof(buf) - 1)
        n = sizeof(buf) - 1;
    memcpy(buf, mp.decoded.payload.bytes, n);
    buf[n] = '\0';

    // Skip leading whitespace
    char *cmd = buf;
    while (*cmd == ' ' || *cmd == '\t')
        cmd++;

    // Only intercept commands starting with '/'
    if (cmd[0] != '/') {
        return ProcessMessage::CONTINUE;
    }

    // Skip the '/' prefix
    cmd++;

    LOG_INFO("InheroMr2: CLI command from 0x%08x: /%s", mp.from, cmd);

    // Flash LED2 briefly to indicate CLI activity
    cliFlashUntil = millis() + 200;

    handleCliCommand(mp, cmd);

    // CONTINUE so TextMessageModule still stores/displays the command in chat history
    return ProcessMessage::CONTINUE;
}

/// Check if sender's public key matches one of config.security.admin_key[0..2]
/// Only accepts PKI-encrypted DMs or local (serial/BLE) connections.
/// Channel-encrypted DMs are rejected because mp.from is not cryptographically bound.
bool InheroMr2Module::isAuthorizedAdmin(const meshtastic_MeshPacket &mp)
{
    // Local messages (serial/BLE connected) are always trusted
    if (mp.from == 0) {
        return true;
    }

