liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
    // Reject non-PKI messages — channel-encrypted DMs have no cryptographic sender proof
    if (!mp.pki_encrypted) {
        LOG_WARN("InheroMr2: Rejecting non-PKI admin attempt from 0x%08x (channel-encrypted DMs not accepted)", mp.from);
        return false;
    }

    // PKI-encrypted: sender key is cryptographically verified via ECDH
    if (mp.public_key.size != 32) {
        LOG_WARN("InheroMr2: PKI message from 0x%08x has no valid public key", mp.from);
        return false;
    }

    // Compare against all configured admin keys (same logic as AdminModule)
    for (int i = 0; i < 3; i++) {
        if (config.security.admin_key[i].size == 32 &&
            memcmp(mp.public_key.bytes, config.security.admin_key[i].bytes, 32) == 0) {
            LOG_INFO("InheroMr2: Admin key match (slot %d) for 0x%08x", i, mp.from);
            return true;
        }
    }

    LOG_WARN("InheroMr2: Unauthorized admin attempt from 0x%08x", mp.from);
    return false;
}

/// Main CLI dispatcher
void InheroMr2Module::handleCliCommand(const meshtastic_MeshPacket &mp, const char *cmd)
{
    // Skip leading whitespace after '/'
    while (*cmd == ' ' || *cmd == '\t')
        cmd++;

    if (strncmp(cmd, "get ", 4) == 0) {
        // /get commands — read-only, but still require admin for security
        const char *key = cmd + 4;
        while (*key == ' ')
            key++;

        if (strncmp(key, "board.", 6) == 0) {
            handleGetCommand(mp, key + 6);
        } else {
            sendTextReply(mp, "Err: Try /get board.<key> (bat|telem|conf|diag|hwver|frost|imax|mppt|leds|uvlo|ibcal|tccal|batcap|energy|stats|cinfo|togglehiz)");
        }

    } else if (strncmp(cmd, "set ", 4) == 0) {
        // /set commands — require admin authorization
        if (!isAuthorizedAdmin(mp)) {
            sendTextReply(mp, "Err: Not authorized. Requires PKI-encrypted DM with admin_key.");
            return;
        }

        const char *keyAndValue = cmd + 4;
        while (*keyAndValue == ' ')
            keyAndValue++;

        if (strncmp(keyAndValue, "board.", 6) == 0) {
            handleSetCommand(mp, keyAndValue + 6);
        } else {
            sendTextReply(mp, "Err: Try /set board.<key> <value> (bat|imax|frost|mppt|leds|uvlo|ibcal|tccal|batcap|bqreset|soc)");
        }

    } else if (strncmp(cmd, "reboot", 6) == 0) {
        if (!isAuthorizedAdmin(mp)) {
            sendTextReply(mp, "Err: Not authorized");
            return;
        }
        sendTextReply(mp, "Rebooting in 2s...");
        rebootAtMsec = millis() + 2000;

    } else if (strncmp(cmd, "ver", 3) == 0) {
        char response[128];
        snprintf(response, sizeof(response), "Inhero MR-2 | Meshtastic %s", optstr(APP_VERSION));
        sendTextReply(mp, response);

    } else if (strncmp(cmd, "help", 4) == 0) {
        // Send help in multiple messages to avoid payload limit
        sendTextReply(mp,
            "/get board.<key>\n"
            "  bat telem conf diag hwver frost imax mppt\n"
            "  leds uvlo ibcal tccal batcap energy\n"
            "  stats cinfo togglehiz\n"
            "/set board.<key> <value> [admin]\n"
            "  bat <lto2s|lifepo1s|liion1s>\n"
            "  imax <10-1000> frost <0|1> mppt <0|1>\n"
            "  leds <on|off> uvlo <0|1> soc <0-100>\n"
            "  batcap <100-100000> ibcal <mA|reset>\n"
            "  tccal [temp|reset] bqreset\n"
            "/ver /reboot [admin] /help");

    } else {
        sendTextReply(mp, "Err: Unknown command. Try /help");
    }
}

// ============================================================
// /get board.<key> — MeshCore getCustomGetter compatible
// ============================================================

void InheroMr2Module::handleGetCommand(const meshtastic_MeshPacket &mp, const char *key)
{
    char response[256] = {0};

    // Trim trailing whitespace
    char trimmed[64];
    strncpy(trimmed, key, sizeof(trimmed) - 1);
    trimmed[sizeof(trimmed) - 1] = '\0';
    size_t len = strlen(trimmed);
    while (len > 0 && (trimmed[len - 1] == ' ' || trimmed[len - 1] == '\n' || trimmed[len - 1] == '\r')) {
        trimmed[--len] = '\0';
    }

    if (strcmp(trimmed, "bat") == 0) {
        snprintf(response, sizeof(response), "%s", chemistryToString(boardConfig.chemistry));

    } else if (strcmp(trimmed, "hwver") == 0) {
        snprintf(response, sizeof(response), "v0.2 (INA228+RTC)");

    } else if (strcmp(trimmed, "frost") == 0) {
        if (boardConfig.chemistry == BatteryChemistry::LTO_2S) {
            snprintf(response, sizeof(response), "N/A (LTO ignores JEITA)");
        } else {
            snprintf(response, sizeof(response), "frost=%s", boardConfig.frostProtect ? "on" : "off");
        }

    } else if (strcmp(trimmed, "imax") == 0) {
        snprintf(response, sizeof(response), "%umA", boardConfig.chargeCurrentMax_mA);

    } else if (strcmp(trimmed, "mppt") == 0) {
        snprintf(response, sizeof(response), "MPPT=%s", boardConfig.mpptEnabled ? "1" : "0");

    } else if (strcmp(trimmed, "telem") == 0) {
        // Real-time telemetry: VBAT, IBAT, SOC, VSOL, ISOL (MeshCore format)
        int soc = estimateSOC();
        const char *socMethod = socStats.soc_valid ? "CC" : "V"; // CC=Coulomb Counting, V=Voltage
        if (ina228Ok && bq25798Ok && solarData) {
            char batCurStr[16], solCurStr[16];
            snprintf(batCurStr, sizeof(batCurStr), "%.1fmA", batteryData.current_ma);
            snprintf(solCurStr, sizeof(solCurStr), "~%.0fmA", (float)solarData->solar.current);

            if (soc >= 0) {
                snprintf(response, sizeof(response), "B:%.2fV/%s/%.0fC SOC:%d%%(%s) S:%.2fV/%s",
                         batteryData.voltage_mv / 1000.0f, batCurStr, batteryData.die_temp_c,
                         soc, socMethod, solarData->solar.voltage / 1000.0f, solCurStr);
            } else {
                snprintf(response, sizeof(response), "B:%.2fV/%s/%.0fC SOC:N/A S:%.2fV/%s",
                         batteryData.voltage_mv / 1000.0f, batCurStr, batteryData.die_temp_c,
                         solarData->solar.voltage / 1000.0f, solCurStr);
            }
        } else if (ina228Ok) {
            snprintf(response, sizeof(response), "B:%.2fV/%.1fmA/%.0fC SOC:%s%s S:N/A",
                     batteryData.voltage_mv / 1000.0f, batteryData.current_ma, batteryData.die_temp_c,
                     soc >= 0 ? String(soc).c_str() : "N/A",
                     soc >= 0 ? (socStats.soc_valid ? "%(CC)" : "%(V)") : "");
        } else {
            snprintf(response, sizeof(response), "Err: Sensors not ready");
        }

    } else if (strcmp(trimmed, "conf") == 0) {
        // All configuration values (MeshCore format)
        const char *batType = chemistryToString(boardConfig.chemistry);
        const char *frostStr = (boardConfig.chemistry == BatteryChemistry::LTO_2S) ? "N/A" : (boardConfig.frostProtect ? "on" : "off");
        const ChemistryParams &params = getChemistryParams(boardConfig.chemistry);
        snprintf(response, sizeof(response), "B:%s F:%s M:%s I:%umA Vco:%.2f V0:%.2f",
                 batType, frostStr, boardConfig.mpptEnabled ? "1" : "0",
                 boardConfig.chargeCurrentMax_mA,
                 params.chargeVoltage_mV / 1000.0f, params.emptyVoltage_mV / 1000.0f);

    } else if (strcmp(trimmed, "diag") == 0) {
        // Diagnostics
        uint16_t diagFlags = ina228Ok ? ina228.getDiagnosticFlags() : 0;
        bq_charging_status_t chgStatus = bq25798Ok ? bq25798.getChargingStatus() : BQ_CHARGE_NOT_CHARGING;
        bool pgood = bq25798Ok ? bq25798.getChargerStatusPowerGood() : false;
        snprintf(response, sizeof(response), "ina228=%s bq25798=%s diag=0x%04X chg=%u pgood=%u",
                 ina228Ok ? "ok" : "fail", bq25798Ok ? "ok" : "fail",
                 diagFlags, (uint8_t)chgStatus, pgood ? 1 : 0);

    } else if (strcmp(trimmed, "leds") == 0) {
        snprintf(response, sizeof(response), "LEDs: %s (Heartbeat + BQ Stat)",
                 boardConfig.ledsEnabled ? "ON" : "OFF");

    } else if (strcmp(trimmed, "uvlo") == 0) {
        snprintf(response, sizeof(response), "UVLO: %s",
                 boardConfig.uvloEnabled ? "ENABLED" : "DISABLED");

    } else if (strcmp(trimmed, "ibcal") == 0) {
        snprintf(response, sizeof(response), "INA228 calibration: %.4f (1.0=default)",
                 boardConfig.inaCalibration);

    } else if (strcmp(trimmed, "tccal") == 0) {
        snprintf(response, sizeof(response), "TC offset: %+.2fC (0.00=default)",
                 boardConfig.tcCalOffset);

    } else if (strcmp(trimmed, "batcap") == 0) {
        if (boardConfig.batteryCapacity_mAh > 0) {
            snprintf(response, sizeof(response), "%u mAh (set)", boardConfig.batteryCapacity_mAh);
        } else {
            uint8_t idx = (uint8_t)boardConfig.chemistry;
            if (idx >= sizeof(defaultBatteryCapacity) / sizeof(defaultBatteryCapacity[0]))
                idx = (uint8_t)BatteryChemistry::BAT_UNKNOWN;
            snprintf(response, sizeof(response), "%u mAh (default)", defaultBatteryCapacity[idx]);
        }

    } else if (strcmp(trimmed, "energy") == 0) {
        if (ina228Ok) {
            float charge_mah = ina228.readCharge_mAh();
            snprintf(response, sizeof(response), "%.1fmAh", charge_mah);
        } else {
            snprintf(response, sizeof(response), "Err: INA228 not initialized");
        }

    } else if (strcmp(trimmed, "stats") == 0) {
        // Rolling energy statistics (24h / 3d / 7d averages + TTL)
        if (socStats.currentIndex == 0 && socStats.hours[0].timestamp == 0) {
            snprintf(response, sizeof(response), "Stats: No data yet (need >= 1 hour)");
        } else {
            snprintf(response, sizeof(response),
                     "24h:%.0f/%.0fmAh 3d:%.0f/%.0f 7d:%.0f/%.0f TTL:%uh MPPT:%.0f%%",
                     socStats.last_24h_charged_mah, socStats.last_24h_discharged_mah,
                     socStats.avg_3day_daily_charged_mah, socStats.avg_3day_daily_discharged_mah,
                     socStats.avg_7day_daily_charged_mah, socStats.avg_7day_daily_discharged_mah,
                     socStats.ttl_hours, getMpptEnabledPercentage7Day());
        }

    } else if (strcmp(trimmed, "cinfo") == 0) {
        // Charger info: PG status, charging state, HIZ, MPPT
        if (!bq25798Ok) {
            snprintf(response, sizeof(response), "Err: BQ25798 not initialized");
        } else {
            bool pgood = bq25798.getChargerStatusPowerGood();
            bq_charging_status_t chgSt = bq25798.getChargingStatus();
            bool hiz = bq25798.getHIZMode();
            bool mpptEn = bq25798.getMPPTenable();
            uint16_t vbus = solarData ? solarData->solar.voltage : 0;
            snprintf(response, sizeof(response),
                     "PG:%u CHG:%u HIZ:%u MPPT:%u VBUS:%.2fV",
                     pgood ? 1 : 0, (uint8_t)chgSt, hiz ? 1 : 0, mpptEn ? 1 : 0,
                     vbus / 1000.0f);
        }

