liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
    } else if (strcmp(trimmed, "togglehiz") == 0) {
        // Manual HIZ toggle for debugging stuck PGOOD
        if (!bq25798Ok) {
            snprintf(response, sizeof(response), "Err: BQ25798 not initialized");
        } else {
            bool wasPG = bq25798.getChargerStatusPowerGood();
            bq25798.setHIZMode(true);
            delay(200);
            bq25798.setHIZMode(false);
            delay(500);
            bool isPG = bq25798.getChargerStatusPowerGood();
            bq_charging_status_t st = bq25798.getChargingStatus();
            snprintf(response, sizeof(response),
                     "HIZ cycled: PG %u->%u CHG:%u",
                     wasPG ? 1 : 0, isPG ? 1 : 0, (uint8_t)st);
        }

    } else {
        snprintf(response, sizeof(response),
                 "Err: Try board.<bat|hwver|frost|imax|telem|conf|diag|mppt|leds|uvlo|ibcal|tccal|batcap|energy|stats|cinfo|togglehiz>");
    }

    sendTextReply(mp, response);
}

// ============================================================
// /set board.<key> <value> — MeshCore setCustomSetter compatible
// ============================================================

void InheroMr2Module::handleSetCommand(const meshtastic_MeshPacket &mp, const char *keyAndValue)
{
    char response[256] = {0};

    // --- set board.bat <type> ---
    if (strncmp(keyAndValue, "bat ", 4) == 0) {
        const char *val = keyAndValue + 4;
        while (*val == ' ') val++;

        BatteryChemistry newChem = stringToChemistry(val);
        if (newChem != BatteryChemistry::BAT_UNKNOWN) {
            boardConfig.chemistry = newChem;
            saveConfig();
            applyChemistryConfig();
            snprintf(response, sizeof(response), "Bat set to %s", chemistryToString(boardConfig.chemistry));
        } else {
            snprintf(response, sizeof(response), "Err: Try lto2s|lifepo1s|liion1s");
        }

    // --- set board.frost <0|1|on|off> ---
    } else if (strncmp(keyAndValue, "frost ", 6) == 0) {
        if (boardConfig.chemistry == BatteryChemistry::LTO_2S) {
            snprintf(response, sizeof(response), "Err: Frost setting N/A for LTO (JEITA disabled)");
        } else {
            const char *val = keyAndValue + 6;
            while (*val == ' ') val++;
            bool enabled = (strcmp(val, "1") == 0 || strcmp(val, "on") == 0);
            bool disabled = (strcmp(val, "0") == 0 || strcmp(val, "off") == 0);
            if (enabled || disabled) {
                boardConfig.frostProtect = enabled;
                saveConfig();
                applyChemistryConfig();
                snprintf(response, sizeof(response), "Frost %s", enabled ? "enabled" : "disabled");
            } else {
                snprintf(response, sizeof(response), "Err: Try 0|1 or on|off");
            }
        }

    // --- set board.imax <10-1000> ---
    } else if (strncmp(keyAndValue, "imax ", 5) == 0) {
        const char *val = keyAndValue + 5;
        while (*val == ' ') val++;
        int ma = atoi(val);
        if (ma >= 10 && ma <= 1000) {
            boardConfig.chargeCurrentMax_mA = (uint16_t)ma;
            saveConfig();
            if (bq25798Ok)
                bq25798.setChargeLimitA(boardConfig.chargeCurrentMax_mA / 1000.0f);
            snprintf(response, sizeof(response), "Max charge current set to %umA", boardConfig.chargeCurrentMax_mA);
        } else {
            snprintf(response, sizeof(response), "Err: imax range 10-1000 mA");
        }

    // --- set board.mppt <true|false|1|0> ---
    } else if (strncmp(keyAndValue, "mppt ", 5) == 0) {
        const char *val = keyAndValue + 5;
        while (*val == ' ') val++;

        // Case-insensitive compare
        char lower[20];
        strncpy(lower, val, sizeof(lower) - 1);
        lower[sizeof(lower) - 1] = '\0';
        for (char *p = lower; *p; ++p) *p = tolower(*p);

        if (strcmp(lower, "true") == 0 || strcmp(lower, "1") == 0) {
            boardConfig.mpptEnabled = true;
            saveConfig();
            if (bq25798Ok) bq25798.setMPPTenable(true);
            snprintf(response, sizeof(response), "MPPT enabled");
        } else if (strcmp(lower, "false") == 0 || strcmp(lower, "0") == 0) {
            boardConfig.mpptEnabled = false;
            saveConfig();
            if (bq25798Ok) bq25798.setMPPTenable(false);
            snprintf(response, sizeof(response), "MPPT disabled");
        } else {
            snprintf(response, sizeof(response), "Err: Try true|false or 1|0");
        }

    // --- set board.leds <on|off|1|0> ---
    } else if (strncmp(keyAndValue, "leds ", 5) == 0) {
        const char *val = keyAndValue + 5;
        while (*val == ' ') val++;
        bool enabled = (strcmp(val, "1") == 0 || strcmp(val, "on") == 0 || strcmp(val, "ON") == 0);
        bool disabled = (strcmp(val, "0") == 0 || strcmp(val, "off") == 0 || strcmp(val, "OFF") == 0);
        if (enabled || disabled) {
            boardConfig.ledsEnabled = enabled;
            saveConfig();
            updateLEDs();
            snprintf(response, sizeof(response), "LEDs %s", enabled ? "enabled" : "disabled");
        } else {
            snprintf(response, sizeof(response), "Err: Use on/1 or off/0");
        }

    // --- set board.uvlo <true|false|1|0> ---
    } else if (strncmp(keyAndValue, "uvlo ", 5) == 0) {
        const char *val = keyAndValue + 5;
        while (*val == ' ') val++;
        bool enabled = (strcmp(val, "1") == 0 || strcmp(val, "true") == 0);
        bool disabled = (strcmp(val, "0") == 0 || strcmp(val, "false") == 0);
        if (enabled || disabled) {
            boardConfig.uvloEnabled = enabled;
            saveConfig();
            if (ina228Ok) {
                const ChemistryParams &params = getChemistryParams(boardConfig.chemistry);
                if (enabled) {
                    ina228.setUnderVoltageAlert(params.dangerVoltage_mV);
                    ina228.enableAlert(true, false, false);
                } else {
                    ina228.enableAlert(false, false, false);
                }
            }
            snprintf(response, sizeof(response), "UVLO %s", enabled ? "ENABLED" : "DISABLED");
        } else {
            snprintf(response, sizeof(response), "Err: Use true/1 or false/0");
        }

