liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
    // --- set board.ibcal <mA|reset> ---
    } else if (strncmp(keyAndValue, "ibcal ", 6) == 0) {
        const char *val = keyAndValue + 6;
        while (*val == ' ') val++;

        if (strcmp(val, "reset") == 0 || strcmp(val, "RESET") == 0) {
            boardConfig.inaCalibration = 1.0f;
            saveConfig();
            if (ina228Ok) ina228.setCalibrationFactor(1.0f);
            snprintf(response, sizeof(response), "INA228 calibration reset to 1.0000");
        } else {
            float actual_ma = atof(val);
            if (actual_ma < -2000.0f || actual_ma > 2000.0f) {
                snprintf(response, sizeof(response), "Err: Current out of range (-2000 to +2000 mA)");
            } else if (ina228Ok) {
                float measured = batteryData.current_ma;
                if (fabsf(measured) < 1.0f) {
                    snprintf(response, sizeof(response), "Err: Current too low for calibration (%.1fmA)", measured);
                } else {
                    float factor = boardConfig.inaCalibration * (actual_ma / measured);
                    boardConfig.inaCalibration = factor;
                    saveConfig();
                    ina228.setCalibrationFactor(factor);
                    snprintf(response, sizeof(response), "INA228 calibrated: factor=%.4f", factor);
                }
            } else {
                snprintf(response, sizeof(response), "Err: INA228 not initialized");
            }
        }

    // --- set board.tccal [temp|reset] ---
    } else if (strncmp(keyAndValue, "tccal", 5) == 0) {
        const char *rest = keyAndValue + 5;
        if (*rest == ' ') rest++;
        while (*rest == ' ') rest++;

        if (strcmp(rest, "reset") == 0 || strcmp(rest, "RESET") == 0) {
            boardConfig.tcCalOffset = 0.0f;
            saveConfig();
            snprintf(response, sizeof(response), "TC calibration reset to 0.00");
        } else if (*rest != '\0') {
            float actual_temp = atof(rest);
            if (actual_temp < -40.0f || actual_temp > 85.0f) {
                snprintf(response, sizeof(response), "Err: Temp out of range (-40 to +85 C)");
            } else {
                float measured = batteryData.die_temp_c;
                boardConfig.tcCalOffset = actual_temp - measured;
                saveConfig();
                snprintf(response, sizeof(response), "TC calibrated: offset=%+.2fC", boardConfig.tcCalOffset);
            }
        } else {
            snprintf(response, sizeof(response), "Err: Use /set board.tccal <temp_C> or /set board.tccal reset");
        }

    // --- set board.batcap <100-100000> ---
    } else if (strncmp(keyAndValue, "batcap ", 7) == 0) {
        const char *val = keyAndValue + 7;
        while (*val == ' ') val++;
        uint32_t cap = (uint32_t)atol(val);
        if (cap >= 100 && cap <= 100000) {
            boardConfig.batteryCapacity_mAh = cap;
            saveConfig();
            snprintf(response, sizeof(response), "Battery capacity set to %u mAh", cap);
        } else {
            snprintf(response, sizeof(response), "Err: Invalid capacity (100-100000 mAh)");
        }

    // --- set board.bqreset ---
    } else if (strcmp(keyAndValue, "bqreset") == 0) {
        if (bq25798Ok) {
            bq25798.reset();
            delay(100);
            applyChemistryConfig();
            snprintf(response, sizeof(response), "BQ25798 reset done - reconfigured");
        } else {
            snprintf(response, sizeof(response), "Err: BQ25798 not initialized");
        }

    // --- set board.soc <0-100> ---
    } else if (strncmp(keyAndValue, "soc ", 4) == 0) {
        const char *val = keyAndValue + 4;
        while (*val == ' ') val++;
        float soc = atof(val);
        if (soc >= 0.0f && soc <= 100.0f) {
            if (setSOCManually(soc)) {
                snprintf(response, sizeof(response), "SOC set to %.0f%% (Coulomb counting baseline recalculated, cap=%umAh)",
                         soc, getEffectiveCapacity());
            } else {
                snprintf(response, sizeof(response), "Err: INA228 not ready or capacity=0");
            }
        } else {
            snprintf(response, sizeof(response), "Err: SOC must be 0-100");
        }

    } else {
        snprintf(response, sizeof(response),
                 "Err: Try board.<bat|imax|frost|mppt|leds|uvlo|ibcal|tccal|batcap|bqreset|soc>");
    }

    sendTextReply(mp, response);
}

// ============================================================
// Text message reply — sends response as DM on TEXT_MESSAGE_APP
// ============================================================

void InheroMr2Module::sendTextReply(const meshtastic_MeshPacket &mp, const char *text)
{
    meshtastic_MeshPacket *p = allocDataPacket(); // allocates with our portnum (TEXT_MESSAGE_APP)
    p->to = mp.from;
    p->channel = mp.channel;
    p->want_ack = false;
    p->decoded.want_response = false;

    size_t textLen = strlen(text);
    if (textLen > sizeof(p->decoded.payload.bytes))
        textLen = sizeof(p->decoded.payload.bytes);
    memcpy(p->decoded.payload.bytes, text, textLen);
    p->decoded.payload.size = textLen;
    p->priority = meshtastic_MeshPacket_Priority_RELIABLE;

    service->sendToMesh(p, RX_SRC_LOCAL, true);
}

// ============================================================
// Battery chemistry string helpers (MeshCore compatible names)
// ============================================================

const char *InheroMr2Module::chemistryToString(BatteryChemistry chem)
{
    switch (chem) {
    case BatteryChemistry::LTO_2S:      return "lto2s";
    case BatteryChemistry::LiFePO4_1S:  return "lifepo1s";
    case BatteryChemistry::Li_Ion_1S:   return "liion1s";
    default:                            return "unknown";
    }
}

BatteryChemistry InheroMr2Module::stringToChemistry(const char *str)
{
    // Support both MeshCore names and alternative aliases
    if (strcmp(str, "lto2s") == 0 || strcmp(str, "lto") == 0)
        return BatteryChemistry::LTO_2S;
    if (strcmp(str, "lifepo1s") == 0 || strcmp(str, "lifepo4") == 0 || strcmp(str, "lfp") == 0)
        return BatteryChemistry::LiFePO4_1S;
    if (strcmp(str, "liion1s") == 0 || strcmp(str, "liion") == 0)
        return BatteryChemistry::Li_Ion_1S;
    return BatteryChemistry::BAT_UNKNOWN;
}

// === Battery Chemistry & Charger Management ===

void InheroMr2Module::applyChemistryConfig()
{
    if (!bq25798Ok)
        return;

    const ChemistryParams &params = getChemistryParams(boardConfig.chemistry);

    // Set charge voltage limit (API expects volts)
    bq25798.setChargeLimitV(params.chargeVoltage_mV / 1000.0f);

    // Set charge current limit (API expects amps)
    bq25798.setChargeLimitA(boardConfig.chargeCurrentMax_mA / 1000.0f);

    // MPPT
    bq25798.setMPPTenable(boardConfig.mpptEnabled);

    // JEITA frost protection
    if (boardConfig.frostProtect) {
        // Below 0°C: reduce charge voltage by 200mV, current to 20%
        bq25798.setJeitaVSet(BQ_JEITA_VSET_MINUS_200MV);
        bq25798.setJeitaISetC(BQ_JEITA_ISETC_20_PERCENT);
        bq25798.setTsCool(BQ_TS_COOL_5C);
        bq25798.setTsIgnore(false);
    } else {
        bq25798.setTsIgnore(true);
    }

    // Configure INA228 UVLO alert based on chemistry
    if (ina228Ok) {
        ina228.setUnderVoltageAlert(params.dangerVoltage_mV);
        ina228.enableAlert(true, false, false); // UVLO, active-low, transparent mode
    }

