liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
    LOG_INFO("InheroMr2: Applied chemistry config (charge=%umV, danger=%umV, imax=%umA, mppt=%u)", params.chargeVoltage_mV,
             params.dangerVoltage_mV, boardConfig.chargeCurrentMax_mA, boardConfig.mpptEnabled);
}

void InheroMr2Module::updateLEDs()
{
    if (!boardConfig.ledsEnabled) {
        ledOff(PIN_LED1);
        ledOff(PIN_LED2);
        return;
    }

    // === LED2 (Red) — Priority-based status indicator ===
    //
    // Priority 1: DANGER VOLTAGE  — 100ms flash every 3s (battery critically low, conserve power)
    // Priority 2: ERROR CONDITION — 500ms on/off blink (missing I2C component)
    // Priority 3: CLI COMMAND     — 200ms flash (remote admin activity)
    // Priority 4: OFF             — normal operation (BQ25798 STAT-LED handles charging)

    const ChemistryParams &params = getChemistryParams(boardConfig.chemistry);
    bool dangerVoltage = ina228Ok && batteryData.voltage_mv > 0 &&
                         batteryData.voltage_mv < params.dangerVoltage_mV;

    if (dangerVoltage) {
        // P1: Short blink every 3s — battery in danger zone (conserve power)
        uint32_t phase = millis() % 3000;
        if (phase < 100) {
            ledOn(PIN_LED2);
        } else {
            ledOff(PIN_LED2);
        }
    } else if (errorLedActive) {
        // P2: 500ms on/off — missing I2C component (INA228 or BQ25798)
        uint32_t phase = millis() % 1000;
        if (phase < 500) {
            ledOn(PIN_LED2);
        } else {
            ledOff(PIN_LED2);
        }
    } else if (millis() < cliFlashUntil) {
        // P3: Brief flash — CLI command was processed
        ledOn(PIN_LED2);
    } else {
        // P4: Off — BQ25798 hardware STAT-LED shows charging state
        ledOff(PIN_LED2);
    }
}

int InheroMr2Module::estimateSOC()
{
    // Primary: Coulomb counting (if calibrated)
    if (socStats.soc_valid)
        return constrain((int)socStats.current_soc_percent, 0, 100);

    // Fallback: Voltage-based estimation (before first charge-done calibration)
    return estimateSOCFromVoltage();
}

int InheroMr2Module::estimateSOCFromVoltage()
{
    if (!ina228Ok || batteryData.voltage_mv == 0)
        return -1;

    const ChemistryParams &params = getChemistryParams(boardConfig.chemistry);

    if (batteryData.voltage_mv >= params.fullVoltage_mV)
        return 100;
    if (batteryData.voltage_mv <= params.emptyVoltage_mV)
        return 0;

    int soc =
        (int)(((float)(batteryData.voltage_mv - params.emptyVoltage_mV) / (params.fullVoltage_mV - params.emptyVoltage_mV)) *
              100.0f);
    return constrain(soc, 0, 100);
}

uint32_t InheroMr2Module::getEffectiveCapacity()
{
    if (boardConfig.batteryCapacity_mAh > 0)
        return boardConfig.batteryCapacity_mAh;
    uint8_t idx = (uint8_t)boardConfig.chemistry;
    if (idx >= sizeof(defaultBatteryCapacity) / sizeof(defaultBatteryCapacity[0]))
        idx = (uint8_t)BatteryChemistry::BAT_UNKNOWN;
    return defaultBatteryCapacity[idx];
}

void InheroMr2Module::updateBatterySOC()
{
    if (!ina228Ok)
        return;

    // Read INA228 hardware Coulomb counter (mAh)
    // Positive = charging (into battery), Negative = discharging
    float charge_mah = ina228.readCharge_mAh();

    // Delta tracking (runs always, independent of SOC validity)
    if (firstChargeRead) {
        lastChargeMah = charge_mah;
        firstChargeRead = false;
    } else {
        float delta_mah = charge_mah - lastChargeMah;
        lastChargeMah = charge_mah;

        // Ignore huge jumps > 10Ah (counter wrap or reset)
        if (delta_mah > 10000.0f || delta_mah < -10000.0f) {
            LOG_WARN("InheroMr2: Coulomb counter jump ignored (%.1f mAh)", delta_mah);
        }
    }

    // Auto-sync: BQ25798 reports "Charging Done" -> set SOC=100%
    if (bq25798Ok) {
        bq_charging_status_t status = bq25798.getChargingStatus();
        if (status == BQ_CHARGE_DONE) {
            if (!socStats.soc_valid) {
                syncSOCToFull(); // First calibration point
                LOG_INFO("InheroMr2: SOC calibrated to 100%% (first charge-done)");
            } else if (socStats.current_soc_percent < 99.0f) {
                syncSOCToFull(); // Re-sync drift
                LOG_INFO("InheroMr2: SOC re-synced to 100%% (charge-done)");
            }
        }
    }

    if (!socStats.soc_valid)
        return; // Wait for first calibration

    // === Core SOC formula (ported from MeshCore) ===
    // Net charge since baseline reset
    float net_charge_mah = charge_mah - socStats.ina228_baseline_mah;

    // Remaining = capacity + net charge (net is negative when discharging)
    uint32_t capacity = getEffectiveCapacity();
    if (capacity == 0)
        return;

    float remaining_mah = (float)capacity + net_charge_mah;
    socStats.current_soc_percent = (remaining_mah / (float)capacity) * 100.0f;

    // Clamp
    if (socStats.current_soc_percent > 100.0f)
        socStats.current_soc_percent = 100.0f;
    if (socStats.current_soc_percent < 0.0f)
        socStats.current_soc_percent = 0.0f;
}

void InheroMr2Module::syncSOCToFull()
{
    if (!ina228Ok)
        return;

    // Reset INA228 hardware Coulomb counter (clears CHARGE + ENERGY registers)
    ina228.resetCoulombCounter();

    // Set baseline to 0 (counter was just reset)
    socStats.ina228_baseline_mah = 0;

    // Mark as fully charged
    socStats.current_soc_percent = 100.0f;
    socStats.soc_valid = true;
}

bool InheroMr2Module::setSOCManually(float soc_percent)
{
    if (!ina228Ok)
        return false;
    if (soc_percent < 0.0f || soc_percent > 100.0f)
        return false;

    uint32_t capacity = getEffectiveCapacity();
    if (capacity == 0)
        return false;

    // Read current CHARGE register value
    float current_charge_mah = ina228.readCharge_mAh();

    // Calculate baseline so that: remaining = capacity + (charge - baseline)
    // remaining = (soc/100) * capacity
    // baseline = charge - (remaining - capacity)
    float remaining_mah = (soc_percent / 100.0f) * (float)capacity;
    socStats.ina228_baseline_mah = current_charge_mah - (remaining_mah - (float)capacity);

    socStats.current_soc_percent = soc_percent;
    socStats.soc_valid = true;
    return true;
}

bool InheroMr2Module::isBatteryCharging() const
{
    if (!bq25798Ok)
        return false;
    // const_cast needed because getChargingStatus() is not const in the driver
    bq_charging_status_t status = const_cast<BQ25798Driver &>(bq25798).getChargingStatus();
    return (status >= BQ_CHARGE_TRICKLE && status <= BQ_CHARGE_DONE && status != BQ_CHARGE_NOT_CHARGING);
}

