liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
// ============================================================
// Watchdog (nRF52 WDT, 600s timeout — ported from MeshCore)
// ============================================================

void InheroMr2Module::setupWatchdog()
{
#ifdef ARCH_NRF52
    // 600s timeout (~10 minutes) — catches firmware hangs
    // CRV = (timeout_seconds * 32768) - 1
    NRF_WDT->CONFIG = (WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos) |
                      (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos);
    NRF_WDT->CRV = 32768UL * 600UL - 1;
    NRF_WDT->RREN = WDT_RREN_RR0_Msk; // Enable reload register 0
    NRF_WDT->TASKS_START = 1;
    wdtEnabled = true;
    LOG_INFO("InheroMr2: WDT started (600s timeout)");
#endif
}

void InheroMr2Module::feedWatchdog()
{
#ifdef ARCH_NRF52
    if (wdtEnabled) {
        NRF_WDT->RR[0] = WDT_RR_RR_Reload;
    }
#endif
}

// ============================================================
// Danger Zone / Shutdown (ported from MeshCore)
// ============================================================

void InheroMr2Module::initiateShutdown(uint8_t reason)
{
#ifdef ARCH_NRF52
    LOG_WARN("InheroMr2: Initiating shutdown (reason=%u)", reason);

    // Power off the SX1262 radio to minimize current draw during sleep
    #if defined(SX126X_POWER_EN)
    digitalWrite(SX126X_POWER_EN, LOW);
    delay(10);
    #endif

    // Configure RTC wake (6 hours default, 2 hours on low-voltage)
    uint32_t wakeHours = (reason == SHUTDOWN_REASON_LOW_VOLTAGE) ? 2 : 6;
    if (rtcOk) {
        configureRTCWake(wakeHours);
    }

    // Store shutdown reason + danger-zone flag in GPREGRET2 (survives warm resets)
    uint8_t regval = (reason & 0x03);
    if (reason == SHUTDOWN_REASON_LOW_VOLTAGE)
        regval |= GPREGRET2_IN_DANGER_ZONE;
    sd_power_gpregret_clr(1, 0xFF);  // GPREGRET2 = index 1
    sd_power_gpregret_set(1, regval);

    // Halt
    sd_power_system_off();
    // Does not return — wakes via RTC interrupt or button
#endif
}

void InheroMr2Module::configureRTCWake(uint32_t hours)
{
    if (!rtcOk || hours == 0)
        return;

    // RV-3028 I2C address 0x52
    // Countdown Timer configuration:
    //   0x0A-0x0B: Timer Value (16-bit, little-endian)
    //   0x0E: Status Register — clear timer flag (bit 3 = TF)
    //   0x0F: Control 1 — enable countdown timer interrupt (bit 1 = TIE)
    //   0x10: Control 2 — timer clock 1/60 Hz (bits 1:0 = 10), enable timer (bit 2 = TE)

    Wire.beginTransmission(0x52);
    Wire.write(0x0A);
    // Timer value = hours * 60 minutes (1/60 Hz clock = 1 tick per minute)
    uint16_t timerVal = (uint16_t)(hours * 60);
    Wire.write((uint8_t)(timerVal & 0xFF));        // Timer Value Low
    Wire.write((uint8_t)((timerVal >> 8) & 0xFF)); // Timer Value High
    Wire.endTransmission();

    // Clear timer flag in Status Register
    Wire.beginTransmission(0x52);
    Wire.write(0x0E);
    Wire.write(0x00); // Clear all status flags
    Wire.endTransmission();

    // Control 1: Enable Timer Interrupt (TIE = bit 1)
    Wire.beginTransmission(0x52);
    Wire.write(0x0F);
    Wire.write(0x02); // TIE = 1
    Wire.endTransmission();

    // Control 2: Timer Enable + 1/60 Hz clock
    // TE = bit 2, TD[1:0] = bits 1:0 (10 = 1/60 Hz)
    Wire.beginTransmission(0x52);
    Wire.write(0x10);
    Wire.write(0x06); // TE=1, TD=10b (1/60 Hz)
    Wire.endTransmission();

    LOG_INFO("InheroMr2: RTC wake configured for %u hours (%u minutes)", hours, timerVal);
}

// ============================================================
// Solar MPPT Management (ported from MeshCore)
// ============================================================

void InheroMr2Module::checkAndFixPgoodStuck()
{
    if (!bq25798Ok || !solarData)
        return;

    // Problem: VBUS present (solar panel connected) but PGOOD is low
    // BQ25798 can get stuck where it doesn't recognize the input.
    // Solution: Toggle HIZ mode to force input re-detection.

    bool pgood = bq25798.getChargerStatusPowerGood();
    uint16_t vbus_mv = solarData->solar.voltage;

    if (!pgood && vbus_mv > MIN_VBUS_FOR_CHARGING) {
        // Check PG_FLAG to see if BQ has detected any input event
        bool pgFlag = bq25798.checkAndClearPgFlag();
        if (!pgFlag) {
            // No PG event at all — genuinely stuck. Toggle HIZ with cooldown.
            uint32_t now = millis();
            if (now - lastHizToggleTime >= HIZ_TOGGLE_COOLDOWN_MS) {
                lastHizToggleTime = now;
                LOG_WARN("InheroMr2: PGOOD stuck (VBUS=%.2fV, PG=0, no PG_FLAG) — toggling HIZ", vbus_mv / 1000.0f);
                bq25798.setHIZMode(true);
                delay(200);
                bq25798.setHIZMode(false);
            }
        }
    }
}

void InheroMr2Module::checkAndFixSolarLogic()
{
    if (!bq25798Ok)
        return;

    // When PGOOD=1 (solar is connected), ensure MPPT is actually enabled.
    // BQ25798 can sometimes disable MPPT after certain fault events.

    bool pgood = bq25798.getChargerStatusPowerGood();
    if (!pgood || !boardConfig.mpptEnabled)
        return;

    bool mpptCurrentlyEnabled = bq25798.getMPPTenable();
    if (!mpptCurrentlyEnabled) {
        uint32_t now = millis();
        if (now - lastMpptWriteTime >= MPPT_WRITE_COOLDOWN_MS) {
            lastMpptWriteTime = now;
            bq25798.setMPPTenable(true);
            LOG_WARN("InheroMr2: Re-enabled MPPT (was disabled while PG=1)");
        }
    }
}

// ============================================================
// Energy Analytics — Hourly Stats (ported from MeshCore)
// ============================================================

void InheroMr2Module::updateHourlyStats()
{
    uint32_t now = getTime();
    if (now == 0)
        now = millis() / 1000; // Fallback if no RTC/GPS time

    // Check if we've crossed an hour boundary
    if (socStats.lastHourUpdateTime == 0) {
        socStats.lastHourUpdateTime = now;
        return;
    }

    uint32_t elapsed = now - socStats.lastHourUpdateTime;
    if (elapsed < 3600)
        return; // Not yet 1 hour

    // Save current hour's data to the rolling buffer
    HourlyBatteryStats &slot = socStats.hours[socStats.currentIndex];
    slot.timestamp = socStats.lastHourUpdateTime;
    slot.charged_mah = socStats.current_hour_charged_mah;
    slot.discharged_mah = socStats.current_hour_discharged_mah;
    slot.solar_mah = socStats.current_hour_solar_mah;

    // Advance index (circular buffer)
    socStats.currentIndex = (socStats.currentIndex + 1) % HOURLY_STATS_HOURS;

    // Reset accumulators for next hour
    socStats.current_hour_charged_mah = 0;
    socStats.current_hour_discharged_mah = 0;
    socStats.current_hour_solar_mah = 0;
    socStats.lastHourUpdateTime = now;

    // Recalculate rolling statistics from buffer
    calculateRollingStats();
    calculateTTL();

    LOG_DEBUG("InheroMr2: Hourly stats updated (idx=%u, 24h_net=%.0fmAh, TTL=%uh)",
              socStats.currentIndex, socStats.last_24h_net_mah, socStats.ttl_hours);
}

void InheroMr2Module::calculateRollingStats()
{
    // Calculate 24h, 3-day, and 7-day rolling averages from the circular buffer
    float charged_24h = 0, discharged_24h = 0;
    float charged_3d = 0, discharged_3d = 0;
    float charged_7d = 0, discharged_7d = 0;
    uint16_t count_24h = 0, count_3d = 0, count_7d = 0;

    for (int i = 0; i < HOURLY_STATS_HOURS; i++) {
        const HourlyBatteryStats &h = socStats.hours[i];
        if (h.timestamp == 0)
            continue; // Empty slot

        count_7d++;
        charged_7d += h.charged_mah;
        discharged_7d += h.discharged_mah;

