liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
        // 3-day window = 72 hours
        // Use index distance in circular buffer
        int dist = (socStats.currentIndex - 1 - i + HOURLY_STATS_HOURS) % HOURLY_STATS_HOURS;
        if (dist < 72) {
            count_3d++;
            charged_3d += h.charged_mah;
            discharged_3d += h.discharged_mah;
        }
        if (dist < 24) {
            count_24h++;
            charged_24h += h.charged_mah;
            discharged_24h += h.discharged_mah;
        }
    }

    // 24h totals
    socStats.last_24h_charged_mah = charged_24h;
    socStats.last_24h_discharged_mah = discharged_24h;
    socStats.last_24h_net_mah = charged_24h - discharged_24h;

    // 3-day daily averages
    float days_3d = (count_3d > 0) ? (count_3d / 24.0f) : 0;
    if (days_3d > 0) {
        socStats.avg_3day_daily_charged_mah = charged_3d / days_3d;
        socStats.avg_3day_daily_discharged_mah = discharged_3d / days_3d;
        socStats.avg_3day_daily_net_mah = (charged_3d - discharged_3d) / days_3d;
    }

    // 7-day daily averages
    float days_7d = (count_7d > 0) ? (count_7d / 24.0f) : 0;
    if (days_7d > 0) {
        socStats.avg_7day_daily_charged_mah = charged_7d / days_7d;
        socStats.avg_7day_daily_discharged_mah = discharged_7d / days_7d;
        socStats.avg_7day_daily_net_mah = (charged_7d - discharged_7d) / days_7d;
    }

    socStats.living_on_battery = (socStats.last_24h_net_mah < 0);
}

void InheroMr2Module::calculateTTL()
{
    // TTL = remaining_mah / daily_deficit
    // Only meaningful when consuming more than charging (net < 0)

    if (!socStats.soc_valid || socStats.capacity_mah <= 0) {
        socStats.ttl_hours = 0;
        return;
    }

    // Use 3-day average if available, otherwise 24h
    float daily_net = socStats.avg_3day_daily_net_mah;
    if (daily_net == 0 && socStats.last_24h_net_mah != 0) {
        daily_net = socStats.last_24h_net_mah;
    }

    if (daily_net >= 0) {
        // Net positive or zero — battery gaining charge, TTL=∞
        socStats.ttl_hours = 0xFFFF; // Effectively infinite
        return;
    }

    float remaining_mah = (socStats.current_soc_percent / 100.0f) * socStats.capacity_mah;
    float hourly_deficit = (-daily_net) / 24.0f; // Convert daily to hourly (positive number)

    if (hourly_deficit < 0.01f) {
        socStats.ttl_hours = 0xFFFF;
        return;
    }

    uint32_t ttl = (uint32_t)(remaining_mah / hourly_deficit);
    socStats.ttl_hours = (ttl > 0xFFFE) ? 0xFFFE : (uint16_t)ttl;
}

// ============================================================
// MPPT Statistics (ported from MeshCore)
// ============================================================

void InheroMr2Module::updateMpptStats()
{
    if (!bq25798Ok)
        return;

    uint32_t now = getTime();
    if (now == 0)
        now = millis() / 1000;

    // Track whether MPPT is currently enabled
    bool mpptNow = bq25798.getMPPTenable() && bq25798.getChargerStatusPowerGood();

    if (!mpptStatsInitialized) {
        mpptStats.lastUpdateTime = now;
        mpptStats.usingRTC = (getTime() != 0);
        mpptStatsInitialized = true;
        lastMpptStatus = mpptNow;
        return;
    }

    // Accumulate minutes MPPT was enabled
    // runOnce() is called every 10s, so each call ≈ 10s/60 ≈ 0.167 minutes
    // We track as integer minutes — increment every 6 calls (~60s)
    if (mpptNow && lastMpptStatus) {
        // Both previous and current reading show MPPT active: count this interval
        mpptStats.currentHourMinutes++;
    }
    lastMpptStatus = mpptNow;

    // Accumulate energy (solar power * time)
    if (solarData && mpptNow) {
        int32_t power_mW = (int32_t)solarData->solar.voltage * solarData->solar.current / 1000;
        // Each interval is ~10s, energy = power * time (mWh) = power_mW * 10 / 3600000
        mpptStats.currentHourEnergy_mWh += (uint32_t)(power_mW * 10UL / 3600UL);
    }

    // Check hour boundary
    uint32_t elapsed = now - mpptStats.lastUpdateTime;
    if (elapsed >= 3600) {
        // Save to circular buffer
        MpptHourlyStats &slot = mpptStats.hours[mpptStats.currentIndex];
        slot.mpptEnabledMinutes = (uint8_t)min((uint16_t)60, mpptStats.currentHourMinutes);
        slot.timestamp = mpptStats.lastUpdateTime;
        slot.harvestedEnergy_mWh = mpptStats.currentHourEnergy_mWh;

        mpptStats.currentIndex = (mpptStats.currentIndex + 1) % MPPT_STATS_HOURS;
        mpptStats.currentHourMinutes = 0;
        mpptStats.currentHourEnergy_mWh = 0;
        mpptStats.lastUpdateTime = now;
    }
}

float InheroMr2Module::getMpptEnabledPercentage7Day()
{
    uint32_t totalMinutes = 0;
    uint32_t totalSlots = 0;

    for (int i = 0; i < MPPT_STATS_HOURS; i++) {
        if (mpptStats.hours[i].timestamp == 0)
            continue;
        totalMinutes += mpptStats.hours[i].mpptEnabledMinutes;
        totalSlots++;
    }

    if (totalSlots == 0)
        return 0.0f;

    // Perfect = 60 minutes per slot
    return (totalMinutes / (totalSlots * 60.0f)) * 100.0f;
}

// === Config Persistence (LittleFS) ===

#define INHERO_CONFIG_DIR "/inhero"

void InheroMr2Module::loadConfig()
{
    if (!InternalFS.begin()) {
        LOG_WARN("InheroMr2: LittleFS init failed");
        return;
    }
    InternalFS.mkdir(INHERO_CONFIG_DIR);

    char buf[32];

    if (readConfigValue("bat", buf, sizeof(buf)) > 0) {
        boardConfig.chemistry = stringToChemistry(buf);
        if (boardConfig.chemistry == BatteryChemistry::BAT_UNKNOWN && buf[0] != '\0') {
            // Legacy name fallback
            if (strcmp(buf, "lifepo4") == 0)
                boardConfig.chemistry = BatteryChemistry::LiFePO4_1S;
            else if (strcmp(buf, "liion") == 0)
                boardConfig.chemistry = BatteryChemistry::Li_Ion_1S;
        }
    }

    if (readConfigValue("imax", buf, sizeof(buf)) > 0)
        boardConfig.chargeCurrentMax_mA = (uint16_t)atoi(buf);

    if (readConfigValue("mppt", buf, sizeof(buf)) > 0)
        boardConfig.mpptEnabled = (buf[0] == '1');

    if (readConfigValue("leds", buf, sizeof(buf)) > 0)
        boardConfig.ledsEnabled = (buf[0] == '1');

    if (readConfigValue("frost", buf, sizeof(buf)) > 0)
        boardConfig.frostProtect = (buf[0] == '1');

    if (readConfigValue("cal", buf, sizeof(buf)) > 0)
        boardConfig.inaCalibration = atof(buf);

    if (readConfigValue("tccal", buf, sizeof(buf)) > 0)
        boardConfig.tcCalOffset = atof(buf);

    if (readConfigValue("uvlo", buf, sizeof(buf)) > 0)
        boardConfig.uvloEnabled = (buf[0] == '1');

