liekmarflow/meshtastic/variants/nrf52840/inhero_mr2/InheroMr2Module.cpp
    if (readConfigValue("batcap", buf, sizeof(buf)) > 0)
        boardConfig.batteryCapacity_mAh = (uint32_t)atol(buf);

    LOG_INFO("InheroMr2: Config loaded (bat=%s, imax=%u, mppt=%u, uvlo=%u)",
             chemistryToString(boardConfig.chemistry),
             boardConfig.chargeCurrentMax_mA, boardConfig.mpptEnabled, boardConfig.uvloEnabled);
}

void InheroMr2Module::saveConfig()
{
    if (skipFsWrites) {
        LOG_WARN("InheroMr2: saveConfig() skipped (low-voltage boot, skipFsWrites=true)");
        return;
    }

    writeConfigValue("bat", chemistryToString(boardConfig.chemistry));

    char buf[32];
    snprintf(buf, sizeof(buf), "%u", boardConfig.chargeCurrentMax_mA);
    writeConfigValue("imax", buf);

    writeConfigValue("mppt", boardConfig.mpptEnabled ? "1" : "0");
    writeConfigValue("leds", boardConfig.ledsEnabled ? "1" : "0");
    writeConfigValue("frost", boardConfig.frostProtect ? "1" : "0");

    snprintf(buf, sizeof(buf), "%.4f", boardConfig.inaCalibration);
    writeConfigValue("cal", buf);

    snprintf(buf, sizeof(buf), "%.2f", boardConfig.tcCalOffset);
    writeConfigValue("tccal", buf);

    writeConfigValue("uvlo", boardConfig.uvloEnabled ? "1" : "0");

    snprintf(buf, sizeof(buf), "%u", boardConfig.batteryCapacity_mAh);
    writeConfigValue("batcap", buf);

    LOG_INFO("InheroMr2: Config saved");
}

void InheroMr2Module::writeConfigValue(const char *key, const char *value)
{
    char path[64];
    snprintf(path, sizeof(path), "%s/%s.txt", INHERO_CONFIG_DIR, key);
    InternalFS.remove(path);
    using namespace Adafruit_LittleFS_Namespace;
    File file(InternalFS);
    if (file.open(path, FILE_O_WRITE)) {
        file.print(value);
        file.close();
    }
}

size_t InheroMr2Module::readConfigValue(const char *key, char *buffer, size_t maxLen, const char *defaultValue)
{
    char path[64];
    snprintf(path, sizeof(path), "%s/%s.txt", INHERO_CONFIG_DIR, key);

    if (!InternalFS.exists(path)) {
        if (defaultValue) {
            strncpy(buffer, defaultValue, maxLen);
            buffer[maxLen - 1] = '\0';
            return strlen(buffer);
        }
        buffer[0] = '\0';
        return 0;
    }

    using namespace Adafruit_LittleFS_Namespace;
    File file(InternalFS);
    if (!file.open(path, FILE_O_READ)) {
        buffer[0] = '\0';
        return 0;
    }

    size_t bytesRead = file.readBytes(buffer, maxLen - 1);
    buffer[bytesRead] = '\0';

    // Trim trailing whitespace
    while (bytesRead > 0 && (buffer[bytesRead - 1] == '\r' || buffer[bytesRead - 1] == '\n' || buffer[bytesRead - 1] == ' ')) {
        buffer[--bytesRead] = '\0';
    }

    file.close();
    return bytesRead;
}
